spec/vcr/Afterpay_Payment/_execute_void/returns_a_payment.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.us-sandbox.afterpay.com/v2/payments/100101529842/void
    body:
      encoding: UTF-8
      string: '{"requestId":"some_uniqe_val","amount":{"amount":250.0,"currency":"USD"}}'
    headers:
      Authorization:
      - Basic <AUTH TOKEN>
      User-Agent:
      - Faraday v0.17.3
      Content-Type:
      - application/json
  response:
    status:
      code: 201
      message: Created
    headers:
      date:
      - Tue, 01 Jun 2021 10:58:42 GMT
      content-type:
      - application/json
      content-length:
      - '2264'
      connection:
      - close
      http_correlation_id:
      - zem5vjwdjinxeokpd5w4oyzdhi
      x-envoy-upstream-service-time:
      - '63'
      cf-cache-status:
      - DYNAMIC
      cf-request-id:
      - 0a68d2dc0f00002e6a5994b000000001
      expect-ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      set-cookie:
      - __cf_bm=b0f3c47704be3b738519d7687cc874826dd8e50e-1622545122-1800-AaXzRsT3M3Mn9FAW+uCJt0nX33d0cETT1paPegwO3+yyXndBPq7aEFw92ZVgUbxy5S0fITFwJm6nB626TXqZ2hLabMvrvaXxlPnWeMPxiSNo;
        path=/; expires=Tue, 01-Jun-21 11:28:42 GMT; domain=.afterpay.com; HttpOnly;
        Secure; SameSite=None
      strict-transport-security:
      - max-age=31536000; includeSubDomains; preload
      server:
      - cloudflare
      cf-ray:
      - 6587eda679a02e6a-BOM
    body:
      encoding: UTF-8
      string: |-
        {
          "id" : "100101529842",
          "token" : "002.avpv776th25fof4itbfvrc019dqje4ia27qjk5525o3mfosr",
          "status" : "APPROVED",
          "created" : "2021-06-01T10:49:10.774Z",
          "originalAmount" : {
            "amount" : "1000.00",
            "currency" : "USD"
          },
          "openToCaptureAmount" : {
            "amount" : "500.00",
            "currency" : "USD"
          },
          "paymentState" : "PARTIALLY_CAPTURED",
          "merchantReference" : "100101468",
          "refunds" : [ {
            "requestId" : "some_uniqe_val",
            "amount" : {
              "amount" : "250.00",
              "currency" : "USD"
            },
            "refundId" : "1719864",
            "refundedAt" : "2021-06-01T10:58:42.465Z"
          } ],
          "orderDetails" : {
            "consumer" : {
              "phoneNumber" : "",
              "givenNames" : "",
              "surname" : "",
              "email" : "sachin@yourmechanic.com"
            },
            "billing" : {
              "name" : "ADDESS1",
              "line1" : "SOME",
              "line2" : "value",
              "region" : "U.S. state.",
              "postcode" : "000000",
              "countryCode" : "US",
              "phoneNumber" : "5555555"
            },
            "shipping" : {
              "name" : "ADDESS1",
              "line1" : "SOME",
              "line2" : "value",
              "region" : "U.S. state.",
              "postcode" : "000000",
              "countryCode" : "US",
              "phoneNumber" : "5555555"
            },
            "courier" : { },
            "items" : [ ],
            "discounts" : [ ],
            "shippingAmount" : {
              "amount" : "1000.00",
              "currency" : "USD"
            },
            "taxAmount" : {
              "amount" : "1000.00",
              "currency" : "USD"
            }
          },
          "events" : [ {
            "id" : "1tLOnWb3zejkNWCtkfNBoCXiCus",
            "created" : "2021-06-01T10:57:49.981Z",
            "expires" : "2021-06-08T10:57:49.980Z",
            "type" : "AUTH_APPROVED",
            "amount" : {
              "amount" : "1000.00",
              "currency" : "USD"
            },
            "paymentEventMerchantReference" : null
          }, {
            "id" : "1tLOu14Ajgoyoh8lBLhoEuYDgAr",
            "created" : "2021-06-01T10:58:41.543Z",
            "expires" : null,
            "type" : "CAPTURED",
            "amount" : {
              "amount" : "250.00",
              "currency" : "USD"
            },
            "paymentEventMerchantReference" : ""
          }, {
            "id" : "1tLOuCKI3ee5yjWcvfI50uRjqea",
            "created" : "2021-06-01T10:58:42.495Z",
            "expires" : null,
            "type" : "VOIDED",
            "amount" : {
              "amount" : "250.00",
              "currency" : "USD"
            },
            "paymentEventMerchantReference" : null
          } ]
        }
    http_version: 
  recorded_at: Tue, 01 Jun 2021 10:58:42 GMT
recorded_with: VCR 4.0.0
